Autodesk.Revit.DB.TableCellCombinedParameterData.Create
construct a TableCellCombinedParameterData
Since:
2017

Autodesk.Revit.DB.TableCellCombinedParameterData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TableCellCombinedParameterData.ParamId
The parameter id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData.CategoryId
Category id for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData.Separator
The separator for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData.Suffix
The suffix for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData.Prefix
The prefix for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData.SampleValue
The sample/example value for the parameter in text form
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.TableCellCombinedParameterData
The TableCellCombinedParameterData stores the data for combined parameters